ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
    if(Prog_Status.Area_Status[Area_No].File_No >= Prog_Para.Area_File_Num[Area_No] ||\
       Prog_Status.Area_Status[Area_No].File_No >= MAX_FILE_NUM) //所有文件全部都播放了一遍
    {
      Prog_Status.Area_Status[Area_No].File_No = 0;
      Prog_Status.Area_Status[Area_No].Counts++; //文件播放一次+1
      SET_SUM(Prog_Status.Area_Status[Area_No]);

      Calc_Prog_Play_Counts();
      if(Check_Prog_End() > 0) //节目结束了！
      {
         Prog_Status.Play_Status.New_Prog_Flag = NEW_FLAG; //新节目
         Prog_Status.Play_Status.Prog_No ++;
         SET_SUM(Prog_Status.Play_Status);
         return 0;
      }
   }

    debug("\r\nprog %d area %d play new file: %d", Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No);
    //先将文件参数读出 
    //Prog_Status.Area_Status[Area_No].Play_Flag = 0; //关闭本分区显示
    //SET_SUM(Prog_Status.Area_Status[Area_No]);

    if(Prog_Status.Area_Status[Area_No].Last_File_No EQ Prog_Status.Area_Status[Area_No].File_No &&\
       CHK_HT(Prog_Status.Area_Status[Area_No]) &&\
       CHK_SUM(Prog_Status.Area_Status[Area_No]) &&\
       Prog_Status.File_Para[Area_No].Pic_Para.Flag != SHOW_NULL &&\
       Chk_File_Para_HT_Sum(&Prog_Status.File_Para[Area_No]))
    {
        debug("the same as last file ,no update");
       Len = 1;
    }
    else
    {
        Len = 0;
        Prog_Status.Area_Status[Area_No].Last_SCN_No = 0xFFFF;
        Prog_Status.Area_Status[Area_No].Last_File_No = 0xFF; //先预置一个不存在的文件号
        SET_SUM(Prog_Status.Area_Status[Area_No]);
/*
        //如果当前节目有边框，且退出时不清屏，则应该清除边框
        if(Prog_Status.File_Para[Area_No].Pic_Para.Border_Check > 0 &&\
           ((Prog_Status.File_Para[Area_No].Pic_Para.In_Mode >= 2 && Prog_Status.File_Para[Area_No].Pic_Para.In_Mode <= 7) ||\
            Prog_Status.File_Para[Area_No].Pic_Para.Out_Mode EQ 1))
*/

        if(Prog_Status.File_Para[Area_No].Pic_Para.Border_Check > 0)
        {
            //Prog_Status.Area_Status[Area_No].Restore_Border_Flag = 1;
            //Restore_Border_Data(Area_No);
            Clr_Border(&Show_Data, Area_No, Get_Area_Border_Width(Area_No), Get_Area_Border_Height(Area_No));
        }
 
    #if DATA_PREP_EN
        if(GET_VAR(Prep_Data.Para_Prog_No[Area_No]) EQ Prog_Status.Play_Status.Prog_No &&\
           GET_VAR(Prep_Data.Para_File_No[Area_No]) EQ Prog_Status.Area_Status[Area_No].File_No &&\
           GET_VAR(Prep_Data.File_Para_Ok_Flag[Area_No]) EQ DATA_OK &&\
           Chk_File_Para_HT_Sum(&Prep_Data.File_Para[Area_No]))
        {
            memcpy(&Prog_Status.File_Para[Area_No], &Prep_Data.File_Para[Area_No], sizeof(U_File_Para));
            Len = 1;
        }
        else
            Len = Read_File_Para(Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No, \
                           &Prog_Status.File_Para[Area_No].Pic_Para.Flag, \
                           &Prog_Status.File_Para[Area_No], sizeof(U_File_Para));

        SET_VAR(Prep_Data.File_Para_Read_Flag[Area_No], DATA_READ);
    #else
        Len = Read_File_Para(Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No, \
                       &Prog_Status.File_Para[Area_No].Pic_Para.Flag, \
                       &Prog_Status.File_Para[Area_No], sizeof(U_File_Para));
    #endif
    }

    if(Len EQ 0) //读不出来则继续读下一个文件参数
    {
      ASSERT_FAILED();

      Prog_Status.File_Para[Area_No].Pic_Para.Flag = SHOW_NULL;
      Prog_Status.Area_Status[Area_No].New_File_Flag = NEW_FLAG;
      Prog_Status.Area_Status[Area_No].File_No ++;
    }
    else
    {
        //Set_File_Para_HT_Sum(&Prog_Status.File_Para[Area_No]);
        //读出文件参数了，保留为上次读出的文件参数
        Prog_Status.Area_Status[Area_No].Last_File_No = Prog_Status.Area_Status[Area_No].File_No;
        Prog_Status.Area_Status[Area_No].New_File_Flag = 0;
        Prog_Status.Area_Status[Area_No].New_SCN_Flag = NEW_FLAG;
        Prog_Status.Area_Status[Area_No].SCN_No = 0;
    }

    SET_SUM(Prog_Status.Area_Status[Area_No]);
    Set_File_Para_HT_Sum(&Prog_Status.File_Para[Area_No]);
  }

  TRACE();
  //更新文件参数过程中不更新分屏数据
  if(Prog_Status.Area_Status[Area_No].New_File_Flag)// EQ 0 &&
    return 0;

  //更新数据到新的一屏
  if(Prog_Status.Area_Status[Area_No].New_SCN_Flag)
  {
      TRACE();
      //已经到了最大的一幕则切换到下个文件
      if(Prog_Status.Area_Status[Area_No].SCN_No >= Prog_Status.File_Para[Area_No].Pic_Para.SNum)
      {
          Prog_Status.Area_Status[Area_No].New_File_Flag = NEW_FLAG;

          Prog_Status.Area_Status[Area_No].Play_Counts ++;
          if(Prog_Status.Area_Status[Area_No].Play_Counts >= Prog_Status.File_Para[Area_No].Pic_Para.Play_Counts)
          {
            Prog_Status.Area_Status[Area_No].File_No ++;
            Prog_Status.Area_Status[Area_No].Play_Counts = 0;
          }
          SET_SUM(Prog_Status.Area_Status[Area_No]);
          return 0;
      }
/*
      //在连续移动的情况下,在更新新一屏以前,必须将之前屏幕的边框数据恢复,否则边框会出现在移动的图像中
      if(Prog_Status.File_Para[Area_No].Pic_Para.In_Mode >= 2 &&\
         Prog_Status.File_Para[Area_No].Pic_Para.In_Mode <= 7)
      {
          //Prog_Status.Area_Status[Area_No].Restore_Border_Flag = 1;
          Restore_Border_Data(Area_No);
		  //Clr_Border(&Show_Data, Area_No, Get_Area_Border_Width(Area_No), Get_Area_Border_Height(Area_No));
      }
*/
      //读出显示数据
      //Prog_Status.Area_Status[Area_No].Play_Flag = 0; //--读取显示数据过程中将播放标志置0，从而中断程序中不播放
      //SET_SUM(Prog_Status.Area_Status[Area_No]);

      debug("\r\nread prog %d area %d, file %d %dth SCN show data", \
            Prog_No, Area_No, Prog_Status.Area_Status[Area_No].File_No,Prog_Status.Area_Status[Area_No].SCN_No);
#if 0
      if(Prog_Status.Area_Status[Area_No].Last_SCN_No EQ Prog_Status.Area_Status[Area_No].SCN_No &&\
         CHK_HT(Prog_Status.Area_Status[Area_No]) &&\
         CHK_SUM(Prog_Status.Area_Status[Area_No]) &&\
         Check_XXX_Data(Prog_Status.File_Para[Area_No].Pic_Para.Flag) EQ 0)
      {
         debug("the same as last SCN ,no update");
         Len0 = 1;
      }
      else
#endif
      {
          Clear_Area_Data(&Show_Data_Bak, Area_No);

