ngocthanhtnt/ledshow/trunk/ ledshow --username hzy1981/STM32/Usr/app/Main_Show.c
  if(Screen_Status.Self_Test_Flag) //防止重复进入
    return;

  Screen_Status.Self_Test_Flag = 1;

#if QT_EN EQ 0
  //--------对存储器的测试---------------
  Write_Storage_Data(SDI_TEST_DATA, &Data, sizeof(Data));
  Delay_ms(10);
  memset(&Data, 0x00, sizeof(Data));
  Read_Storage_Data(SDI_TEST_DATA, &Data, &Data, sizeof(Data));

  if(0x55AA5AA5 EQ Data)
  {
    debug("SPI Flash 自检成功");
    Re = Re & 1;
  }
  else
  { 
    debug("SPI Flash 自检失败"); 
	Re = 0;
	ErrFlag	|= 0x01;
  }
  //-----------------------------------------

  //--------对时钟的测试---------------------

  //while(1)
  {
 // DS1302_Init();
 /*
  Re &= _Get_Cur_Time(TempTime.Time);
  Print_Cur_Time();
  Delay_sec(1);//Delay_sec(2);
  Re &=_Get_Cur_Time(TempTime1.Time);
  */
  }

  if(TempTime.Time[T_SEC] != TempTime1.Time[T_SEC])
  {
    debug("时钟自检成功");
    Re = Re & 1;
  }
  else
  {
    debug("时钟自检失败"); 
	Re = 0;
	ErrFlag	|= 0x02;
  }
  //-----------------------------------------

  //---------对485和232的测试---------------
  Screen_Status.Rcv_Posi = 0;
  Com_Send_Byte(CH_COM, 0xA5);
  Delay_ms(5); 
  if(Screen_Status.Rcv_Data[0] EQ 0xA5) //自检成功
  {
    debug("串口自检成功");
    Re = Re & 1;
  }
  else
  {
    debug("串口自检失败"); 
	Re = 0;
	ErrFlag	|= 0x04;
  }
  //---------------------------------------

  if(Re EQ 0)
	debug("外围器件自检失败！");
  else
	debug("外围器件自检成功！");

  debug("进入屏幕检测状态");
#endif

  //--------------扫描方式检测---------------
  Read_Screen_Para();

  return;
  //-----------
  Screen_Para.Base_Para.Width = 1024;
  Screen_Para.Base_Para.Height = 32;
  Screen_Para.Scan_Para.Cols_Fold = 0;
  Screen_Para.Scan_Para.Rows_Fold = 0;
  Screen_Para.Scan_Para.Rows = 16;
  Screen_Para.Scan_Para.Direct = 0x02;
  Screen_Para.Base_Para.Color = 0x01;
  SET_SUM(Screen_Para);

  Screen_Status.Open_Flag = 1;

  
  //---------------
  Set_RT_Show_Area(64, 64);
  memset(Show_Data.Color_Data, 0x55, sizeof(Show_Data.Color_Data));

  while(1)
  {
    RT_Play_Status_Enter(2);
    //LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", 1, 2, 3, 4);
    //memset(Show_Data.Color_Data, 0x01, sizeof(Show_Data.Color_Data));
   
    for(n = 0; n < 20; n ++)
	{
	  Delay_ms(100);
	  Screen_Com_Proc();

#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
	}
  }

  while(1)
  {
    if(Mode EQ FAC_TEST && Chk_JP_Status() != SELF_TEST_STATUS) //不是自检状态退出
          break;

    for(i = 0; i < 4; i ++)
	{

        Screen_Para.Scan_Para.Direct = i;

      for(j = 0; j <= MAX_ROWS_FOLD; j ++)
	  {
	    Screen_Para.Scan_Para.Rows_Fold = j;

		if(j EQ 0)
		  Max_Cols_Fold = 1;
	    else
		  Max_Cols_Fold = MAX_COLS_FOLD;

		for(k = 1; k <= Max_Cols_Fold; k ++)
	    {
          Screen_Para.Scan_Para.Cols_Fold = k;
		  
		  //5种扫描方式逐步试验
		  for(m = 0; m < 5; m ++)
		  {
		    if(m EQ 0)
			  Screen_Para.Scan_Para.Rows = 16;  //1/16扫描
			else if(m EQ 1)
			  Screen_Para.Scan_Para.Rows = 8;	//1/8扫描
			else if(m EQ 2)
			  Screen_Para.Scan_Para.Rows = 4;	//1/4扫描
			else if(m EQ 3)
			  Screen_Para.Scan_Para.Rows = 2;	//1/2扫描
			else
			  Screen_Para.Scan_Para.Rows = 1;	//静态扫描

			SET_SUM(Screen_Para);

			RT_Play_Status_Enter(2);
            LED_Print(FONT0, Screen_Para.Base_Para.Color, &Show_Data, 0, 0, 0, "%d%d%d%d", m, i, j, k);
		    //memset(Show_Data.Color_Data, 0x55, sizeof(Show_Data.Color_Data));
           
		    for(n = 0; n < 20; n ++)
			{
			  Delay_ms(100);
			  Screen_Com_Proc();
#if QT_EN
   memcpy(&(w->previewArea->screenPara), &Screen_Para, sizeof(Screen_Para));
   w->previewArea->setFixedSize(Screen_Para.Base_Para.Width, Screen_Para.Base_Para.Height);
   w->previewTimerProc();
#endif
			}

		  }
	    }
	   }
	 }

	 Restore_Show_Area();

  }
}

 //工厂状态自检
 void Fac_Status_Self_Test(void)
 {
   
  if(Chk_JP_Status() != SELF_TEST_STATUS)
    return;

  Delay_ms(10);

  if(Chk_JP_Status() != SELF_TEST_STATUS)
    return;

  Self_Test(FAC_TEST);

 }
